;============================================================
; Vars
;============================================================
sysExitCode equ 60
a equ 127
b equ 9
;============================================================
; Data
;============================================================
section .text
    global _start
;============================================================
; Code
;============================================================
_start:
    xor rax, rax
    mov al, a
    push rax

    call _mulProc

    ;============================================================
    ; Exit
    ;============================================================
    _exit:
    mov rax, sysExitCode
    xor rdi, rdi
    syscall

;|input | = [rsp+16] (1 param)
;param1 * param1 * param1
;|output| = rax
_mulProc:
    push rbp
    mov rbp, rsp
    ;sub rsp, 8

    xor rax, rax
    xor rdx, rdx
    mov rax, [rbp+16]
    mul al              ; поднимаем флаг OF
    mov rbx, [rbp+16]
    mul bx              ; остаток падает в rdx

    mov [rbp-4], ax     ; записываем основную часть в стек
    mov [rbp-2], dx     ; записываем остаток в стек
    mov eax, [rbp-4]    ; записываем разультат в регистр rax

    mov rsp, rbp
    pop rbp
    ret 8     ;каждый переданный параметр +8
