;============================================================
; Info
;============================================================
; Примеры циклов [instr loop]
; 4 раза печатаем 42
; Пример взят из книги "Ассемблер на примерах" 2006г.
;============================================================
; Vars
;============================================================
sysExitCode equ 60
;============================================================
; Data
;============================================================
section .data
    text      db "42", 10, 0
;    textLen    equ $ - answerText
;section .bss
;    buffer          resb 20
section .text
    global _start
;============================================================
; Code
;============================================================
_start:
    xor rcx, rcx
    mov rcx, 4     ; счётчик i=4

    while_loop:
    push rcx

    mov rax, 1
    mov rdi, 1
    mov rsi, text
    mov rdx, 4
    syscall

    pop rcx

    loop while_loop  ; если rcx == 0

    ;============================================================
    ; Exit
    ;============================================================
    mov rax, sysExitCode
    xor rdi, rdi
    syscall
